[
  {
    "id": 1,
    "title": "Dune: Part Two",
    "year": 2024,
    "rating": 4.8,
    "image": "assets/dune2.jpg",
    "synopsis": "Paul Atreides se une a Chani y a los Fremen mientras busca venganza contra los conspiradores que destruyeron a su familia.",
    "comments": [
      {
        "user": "Alice",
        "text": "Una obra maestra visual. Impresionante de principio a fin."
      },
      {
        "user": "Bob",
        "text": "Me encantó la historia, aunque es un poco densa. Gran secuela."
      }
    ]
  },
  {
    "id": 2,
    "title": "Inside Out 2",
    "year": 2024,
    "rating": 4.9,
    "image": "assets/insideout2.jpg",
    "synopsis": "Riley se convierte en una adolescente y sus emociones principales deben lidiar con una nueva emoción: Ansiedad.",
    "comments": [
      {
        "user": "Carlos",
        "text": "Muy emotiva y divertida, perfecta para toda la familia."
      },
      {
        "user": "Diana",
        "text": "Me gustó cómo exploraron las nuevas emociones. ¡Muy bien hecha!"
      }
    ]
  },
  {
    "id": 3,
    "title": "Godzilla x Kong: The New Empire",
    "year": 2024,
    "rating": 3.5,
    "image": "assets/godzillaxkong.jpg",
    "synopsis": "Godzilla y Kong deben unirse contra una amenaza colosal desconocida, escondida dentro de nuestro mundo, que desafía su propia existencia.",
    "comments": [
      {
        "user": "Ethan",
        "text": "Pura acción y efectos especiales. No esperes una gran trama, pero es muy entretenida."
      }
    ]
  },
  {
    "id": 4,
    "title": "Kung Fu Panda 4",
    "year": 2024,
    "rating": 4.1,
    "image": "assets/kfp4.jpg",
    "synopsis": "Po se prepara para ser el Líder Espiritual del Valle de la Paz y debe encontrar y entrenar a un nuevo Guerrero Dragón.",
    "comments": [
      {
        "user": "Fiona",
        "text": "Tan divertida como las anteriores. El villano es genial."
      }
    ]
  },
  {
    "id": 5,
    "title": "The Fall Guy",
    "year": 2024,
    "rating": 4.3,
    "image": "assets/thefallguy.jpg",
    "synopsis": "Un doble de cine en horas bajas trabaja en la película de una ex y debe encontrar al actor principal desaparecido.",
    "comments": [
      {
        "user": "George",
        "text": "Ryan Gosling y Emily Blunt tienen una química increíble. ¡Muy divertida!"
      },
      {
        "user": "Hannah",
        "text": "Un gran homenaje a los dobles de acción. Me reí mucho."
      }
    ]
  },
  {
    "id": 6,
    "title": "Challengers",
    "year": 2024,
    "rating": 4.0,
    "image": "assets/challengers.jpg",
    "synopsis": "Tashi Duncan, una ex prodigio del tenis, ahora entrenadora, se encuentra atrapada en una red de rivalidad con su esposo y su ex novio.",
    "comments": [
      {
        "user": "Ian",
        "text": "Una película intensa y con una dirección fantástica. El triángulo amoroso es fascinante."
      },
      {
        "user": "Julia",
        "text": "La actuación de Zendaya es fantástica. El guion es muy original."
      }
    ]
  },
  {
    "id": 7,
    "title": "Kingdom of the Planet of the Apes",
    "year": 2024,
    "rating": 4.5,
    "image": "assets/kingdomapes.jpg",
    "synopsis": "Muchas generaciones después del reinado de César, los simios son la especie dominante y los humanos viven en la sombra. Un nuevo líder tiránico construye su imperio.",
    "comments": [
      {
        "user": "Kevin",
        "text": "Una gran continuación de la saga. Visualmente impresionante y con una historia sólida."
      }
    ]
  },
  {
    "id": 8,
    "title": "A Quiet Place: Day One",
    "year": 2024,
    "rating": 3.8,
    "image": "assets/aquietplace.jpg",
    "synopsis": "Descubre los aterradores orígenes de la invasión alienígena que obligó a los humanos a vivir en silencio.",
    "comments": [
      {
        "user": "Linda",
        "text": "Muy tensa y aterradora. Te mantiene al borde del asiento."
      },
      {
        "user": "Mike",
        "text": "Buen spin-off, aunque no supera a la primera."
      }
    ]
  }
]